

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
#Если не ВебКлиент тогда
	//TODO: Заменить присваивание на перебор файлов
	//отладка
	//ИмяФайлаХМЛ = Объект.ПутьКРасширению;
	ИмяФайлаХМЛ = "D:\test\1\Documents\ПоступлениеТоваровУслуг\Forms\ФормаДокумента\Ext\Form.xml";
	//TODO: Вставить код чтения ХМЛ
	Ф = Новый ЧтениеXML();
	ф.ИгнорироватьПробелы = истина;
	ф.ОткрытьФайл(ИмяФайлаХМЛ);
	Пока ф.Прочитать() цикл
		Если ф.ТипУзла = ТипУзлаXML.НачалоЭлемента тогда
			Пока ф.ПрочитатьАтрибут() цикл
			стрТЧ = Объект.Результат.Добавить();
			Если ф.ЛокальноеИмяАтрибута(0)=Неопределено тогда
				Продолжить;
			КонецЕсли;
			стртч.ПутьКРеквизиту = "=> "+ф.Значение + " | " + ф.Имя + " | " + ф.ТипУзла;
			конеццикла; 
		КонецЕсли;
			
	КонецЦикла;
		
#КонецЕсли
КонецПроцедуры
